[
  {
    "id": "the-life-of-a-ux-engineer",
    "category": "presentations",
    "title": "The Life of a UX Engineer",
    "description": "What is a UX Engineer? This specialty role sits on a cross-functional design team and helps facilitate collaboration between designers and engineers. This presentation explores the relationship between designers and engineers and how a UX Engineer uses a particular skillset to solve UX problems. Adam presented this deck to around 20 professionals at one of Kin + Carta's monthly design meetups.",
    "description_short": "What is a UX Engineer? This specialty role sits on a cross-functional design team and helps facilitate collaboration between designers and engineers. This presentation explores the relationship between designers and engineers and how a UX Engineer uses a particular skillset to solve UX problems.",
    "date": "August 2020",
    "role": "Designer, Presenter",
    "tech": ["React", "JavaScript", "HTML/CSS", "Adobe Illustrator", "Figma"],
    "image": "../images/banners/the-life-of-a-ux-engineer-painting.jpg",
    "imageAltText": "The Life of a UX Engineer Painting",
    "buttons": [
      {
        "to": "https://drive.google.com/file/d/1mHUDzD7EzfrRR03Z_1WNsduszsIUj4ny/view?usp=drive_link",
        "name": "View Deck",
        "icon": "picture_as_pdf"
      }
    ],
    "sections": [
      {
        "gallery": [
          "../images/screenshots/the-life-of-a-ux-engineer-screenshot-01.jpg",
          "../images/screenshots/the-life-of-a-ux-engineer-screenshot-02.jpg",
          "../images/screenshots/the-life-of-a-ux-engineer-screenshot-03.jpg",
          "../images/screenshots/the-life-of-a-ux-engineer-screenshot-04.jpg",
          "../images/screenshots/the-life-of-a-ux-engineer-screenshot-05.jpg",
          "../images/screenshots/the-life-of-a-ux-engineer-screenshot-06.jpg",
          "../images/screenshots/the-life-of-a-ux-engineer-screenshot-07.jpg",
          "../images/screenshots/the-life-of-a-ux-engineer-screenshot-08.jpg"
        ]
      }
    ]
  },
  {
    "id": "an-animation-story",
    "category": "presentations",
    "title": "An Animation Story",
    "description": "A love story between a girl named Design and a boy named Animation. Adam created, narrated, and presented this story to a group of 20 developers at Solstice in order to talk about the importance of having a \"design-gineering\" mindset and the value of the relationship between designers and engineers.",
    "description_short": "A love story between a girl named Design and a boy named Animation. Adam created, narrated, and presented this story to a group of developers in order to talk about the importance of having a \"design-gineering\" mindset and the value of the relationship between designers and engineers.",
    "date": "August 2017",
    "role": "Designer, Animator, Narrator",
    "tech": ["Unity", "C#"],
    "image": "../images/banners/an-animation-story-painting.jpg",
    "imageAltText": "An Animation Story Painting",
    "sections": [
      {
        "mainVideo": "uHQvPFud3-I"
      },
      {
        "title": "Postface",
        "paragraphs": [
          "So, what the heck was that all about? And what ever happened to Engineering? Well, this story highlights the Design-Engineering mindset, or rather the lack of. Too often do I see us breaking designers' hearts. It seems implementing a design exactly as it was created often presents a problem. But instead of solving the problem, we find ways to avoid it. \"Oh this increases technical complexity, let's simplify\". \"Oh this skyrockets our scope, let's do this later\" (aka never). Specifically, implementing animations is a common trigger to these excuses.",
          "Why is it so important to not break out designers hearts? In my opinion, a great design tells a story. It evokes emotions and brings character to the product. Animation is a tool in a designer's toolbelt that brings life to a design. It is a story in of itself - the change of values over time from one point to another. You see, when we find reasons to not fulfill a designer's creation, to not implement their animations, or any other design element for that matter, we are taking the life out of the design. We are stripping it of character and emotion.",
          "What ever happened to Engineering? Perhaps he makes an epic return in Chapter 2. Perhaps not. It is our job as engineers to create Chapter 2...to not break our designers hearts. And, so, honestly I don't see the value in sitting here and showing you how to implement animations. Because, I believe that without a \"design-gineering\" mindset, we will continue to find excuses not to meet design face to face. I don't think you all need to be as passionate about design or animation as I am, but I think we all have to at least appreciate what it is a designer does, and the impact their designs have on a product.",
          "I encourage everyone to work very closely with your designers. Understand what it is they do everyday, what problems they think about, and what tools they use to solve those problems. The best way to understand a designer is to become one. This, in my opinion, is what the \"design-gineering\" mindset is all about."
        ]
      }
    ]
  },
  {
    "id": "entering-the-new-reality",
    "category": "presentations",
    "title": "Entering the New Reality",
    "description_short": "A presentation exploring the technologies of VR, AR, and MR. What are the differences between these technologies? What industries will it disrupt and who will be building these applications? What problems will they solve? These are the questions to be answered.",
    "description_long": [
      "A presentation exploring the technologies of VR, AR, and MR. What are the differences between these technologies? What industries will it disrupt and who will be building these applications? What problems will they solve? These are the questions to be answered.",
      "Adam presented this deck alongside 3 other Solstice engineers during a monthly Solstice Mobile meetup. There were about 100 people that attended the event and listened to the presentation."
    ],
    "date": "May 2016",
    "role": "VR Engineer, Co-Presenter",
    "tech": ["Unity", "Oculus Rift", "HTC Vive", "Microsoft HoloLens"],
    "image": "../images/banners/entering-the-new-reality-painting.jpg",
    "imageAltText": "Entering the New Reality Painting",
    "buttons": [
      {
        "to": "https://drive.google.com/file/d/1nw_EMTZB47svcDjgCPaSAAPE84gNYqfK/view?usp=drive_link",
        "name": "View Deck",
        "icon": "picture_as_pdf"
      }
    ],
    "sections": [
      {
        "gallery": [
          "../images/screenshots/entering-the-new-reality-screenshot-01.jpg",
          "../images/screenshots/entering-the-new-reality-screenshot-02.jpg",
          "../images/screenshots/entering-the-new-reality-screenshot-03.jpg",
          "../images/screenshots/entering-the-new-reality-screenshot-04.jpg",
          "../images/screenshots/entering-the-new-reality-screenshot-05.jpg",
          "../images/screenshots/entering-the-new-reality-screenshot-06.jpg",
          "../images/screenshots/entering-the-new-reality-screenshot-07.jpg",
          "../images/screenshots/entering-the-new-reality-screenshot-08.jpg"
        ]
      },
      {
        "title": "Preface",
        "paragraphs": [
          "If you were at or watched Facebook's F8 conference and witnessed their 10 year roadmap, you may have noticed how the company plans to continue to invest in not only Virtual Reality with its Oculus, but also into augmented reality as well. They even stated that future headsets would be the size of a normal pair of glasses and would be able to not only handle AR, but VR as well all in one platform. Considering the social-networking leader's Q1 revenue jumped 52% year over year to $5.38 billion, topping the consensus estimate of $5.26 billion. It would be safe to assume that they have a good idea of where the market is heading.",
          "It is nothing new that these technologies are becoming more and more prominent and focused on by several big name players such as Samsung, HTC, Google, and Microsoft. Rumors have been flying around about a possible Google Headset in the works with the release of Android N's second developer preview where there are references to virtual reality capabilities. Furthermore, \"VR\" is an entire content track at Google I/O this year, with seven sessions dedicated to virtual or augmented reality, based on the schedule posted by Google.",
          "So ok we established that this is important and worth paying attention to. However, where are we exactly with these reality technologies? Is it at a mature state at this point where the barrier entry for producing a successful application have been reduced that any developer can produce a VR or AR application? What's the difference between VR and AR? What does it take to build one of these new \"reality\" applications? What problems will they solve? What industries will it disrupt and who will be building these applications? Will it only be important to the gaming industry? Are we scratching the surface with these platforms? What can we predict these platforms will become in the near future?"
        ]
      }
    ]
  },
  {
    "id": "3d-application-development-overview",
    "category": "presentations",
    "title": "3D Application Development",
    "description_short": "A presentation to teach introductory concepts for 3D application development covering topics across art, design, and tech. The presentation serves as a starting point from which creators can continue to grow their knowledge.",
    "description_long": [
      "A presentation to teach introductory concepts for 3D application development covering topics across art, design, and tech. The presentation serves as a starting point from which creators can continue to grow their knowledge by providing high-level, easy-to-understand definitions that give a taste of the information they might need to know when developing a 3D application.",
      "The deck is grounded in the Unity engine to provide real, applicable examples of the concepts. Adam presented this deck to around 30 software professionals who were interested in learning more."
    ],
    "date": "April 2016",
    "role": "Designer, Presenter",
    "tech": ["Unity", "C#", "Blender"],
    "image": "../images/banners/3d-application-development-overview-painting.jpg",
    "imageAltText": "3D Application Development Painting",
    "buttons": [
      {
        "to": "https://drive.google.com/file/d/1r2DCuz7PckbaD0CH4NWlKIK1X5-po9MI/view?usp=drive_link",
        "name": "View Deck",
        "icon": "picture_as_pdf"
      }
    ],
    "sections": [
      {
        "gallery": [
          "../images/screenshots/3d-application-development-overview-screenshot-01.jpg",
          "../images/screenshots/3d-application-development-overview-screenshot-02.jpg",
          "../images/screenshots/3d-application-development-overview-screenshot-03.jpg",
          "../images/screenshots/3d-application-development-overview-screenshot-04.jpg",
          "../images/screenshots/3d-application-development-overview-screenshot-05.jpg",
          "../images/screenshots/3d-application-development-overview-screenshot-06.jpg",
          "../images/screenshots/3d-application-development-overview-screenshot-07.jpg",
          "../images/screenshots/3d-application-development-overview-screenshot-08.jpg"
        ]
      }
    ]
  }
]
