[
  {
    "id": "blockchain-gardens",
    "category": "tech",
    "title": "Blockchain Gardens",
    "description_short": "Blockchain Gardens is a real-time 3D visualization of a private Ethereum blockchain instance running at an annual tech conference that records every booth an attendee visits via RFID readers.",
    "description_long": [
      "The blockchain is as complicated, misunderstood and powerfully compelling as any emerging technology that currently exists. It's no longer sufficient to merely explain the technical nuances and intricacies, the time has come for you to experience them. Built on the Ethereum backbone, Solstice FWD attendees participated in one of the first human blockchain experiments in history. Interactions and exchanges were recorded on the FWD ledger and the \"future of trust in a trustless world\" was on full display.",
      "Blockchain Gardens is a real-time 3D visualization of a private Ethereum blockchain instance displayed at Solstice's annual digital innovation summit. Attendees at the event were tracked throughout the space by an RFID in their badge. As they visited each event booth, these moments and experiences were recorded on the blockchain. We wanted to explore what it would be like to put humans at the center of this emerging technology."
    ],
    "date": "June 2018",
    "role": "Front-end Developer, 3D Designer",
    "tech": ["Unity", "C#", "Ethereum", "Firebase", "RFID", "AWS", "PCF"],
    "image": "../images/banners/blockchain-gardens-painting.jpg",
    "imageAltText": "Blockchain Gardens Painting",
    "sections": [
      {
        "title": "Media",
        "gallery": [
          "../images/screenshots/blockchain-gardens-screenshot-01.jpg",
          "../images/screenshots/blockchain-gardens-screenshot-02.jpg",
          "../images/screenshots/blockchain-gardens-screenshot-03.jpg",
          "../images/screenshots/blockchain-gardens-screenshot-04.jpg"
        ],
        "videos": [
          "R-OoF7NQWOI",
          "s7MI_uzRdMI",
          "Ng0IEkbdkHc"
        ]
      }
    ]
  },
  {
    "id": "rockstar",
    "category": "tech",
    "title": "RockstAR",
    "description_short": "RockstAR is an interactive AR experience that couples the power of Microsoft's HoloLens, Philips Hue Lightbulbs, and a series of stage technologies to give users the ability to customize a live rock band experience.",
    "description_long": [
      "Augmented reality is making it possible to merge virtual objects into the physical world around us. To explore the possibilities, Adam and fellow Solstice engineers built RockstAR, an interactive AR experience demoed at Solstice FWD. By coupling the power of Microsoft's HoloLens, Philips Hue Lightbulbs, and a series of stage technologies, users are given the ability to customize a live rock band experience.",
      "You can choose your song and color theme preferences using digital menus. Once you're ready to go, the band plays your song as you set the stage for your audience and let the lights groove to the beat. You might look a little odd pointing to things no one else can see, but the joke's on them - you're the star of the show!"
    ],
    "date": "September 2016",
    "role": "Front-end Developer, Experience Designer",
    "tech": ["Unity", "C#", "HoloLens", "Raspberry Pi + Node.js", "Phillips Hue Lights", "IoT Devices", "iPad"],
    "image": "../images/banners/rockstar-painting.jpg",
    "imageAltText": "RockstAR Painting",
    "sections": [
      {
        "title": "Media",
        "gallery": [
          "../images/screenshots/rockstar-screenshot-01.jpg",
          "../images/screenshots/rockstar-screenshot-02.jpg",
          "../images/screenshots/rockstar-screenshot-03.jpg"
        ],
        "videos": [
          "9VotoUsUsew",
          "fUKUr3F2VVM",
          "zQn6-UV4tGQ"
        ]
      }
    ]
  },
  {
    "id": "vender-vr",
    "category": "tech",
    "title": "Vender VR",
    "description_short": "Vender is an IoT connected vending machine. Adam expanded Vender to the virtual world, creating the first ever VR vending machine experience where vending a drink in VR would vend the same drink in real-life.",
    "description_long": [
      "Vender is an IoT connected vending machine that started as an R&D project at Solstice before Adam joined the team. Less than a month before Solstice's digital innovation summit, Adam expanded Vender to the virtual world and vending a drink in VR would vend the same drink in real-life.",
      "A user vends the drink of their choice by putting their hand up to one of the drink taps and waiting for the cup to be filled. Once filled, a service call is made to a Raspberry Pi hooked up to the vending machine, which then vends the user's drink. Drink choices are populated from a Hybris Platform which stores and manages all of Vender's data."
    ],
    "date": "September 2015",
    "role": "Unity Developer",
    "tech": ["Unity", "C#", "Oculus Rift", "Leap Motion", "Raspberry Pi", "Hybris Platform"],
    "image": "../images/banners/vender-vr-painting.jpg",
    "imageAltText": "Vender VR Painting",
    "sections": [
      {
        "title": "Media",
        "gallery": [
          "../images/screenshots/vender-vr-screenshot-01.jpg",
          "../images/screenshots/vender-vr-screenshot-02.jpg",
          "../images/screenshots/vender-vr-screenshot-03.jpg"
        ],
        "videos": [
          "aBnGN1j3OMM",
          "Y-1ZXwGhHM8",
          "nHNOTxh7Rdg"
        ]
      }
    ]
  }
]
